InformationRegisters/ИсторияВыполненияПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ИсторияВыполненияПроцессов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПроцесса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭкземплярПроцесса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РегистрСостоянийОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РегистрСостоянийОбъектов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СостояниеОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыДляСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтложеннаяОбработкаЭтаповПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтложеннаяОбработкаЭтаповПроцессов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяЗавершенияЗадания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтапПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыУниверсальныхПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПроцесса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭкземплярПроцесса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияОтложеннойОбработкиПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипКлючевогоОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыБД</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Заместители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Заместители</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗамещаемыйПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заместитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИИТ_УведомленияОВозвратеСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ИИТ_УведомленияОВозвратеСогласования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОповещенийПользователейУХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыОповещенийПользователейУХ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцессЗапущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтапСогласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Утверждена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/КомментарийИСогласование/Ext/Form/Module.bsl
#Область Перенос_Доработок

//ИИТ_Аксеньюшкин
&НаСервере
Функция ВернутьМассивДляПередачиПоОповещениюПоТекущемуСогласующему(ПроизвольныйЭтап = Неопределено, ТекущийСогласующий = Неопределено)

	ТекущийЭтап = Новый Массив;

	ПакетДокументовСвертка = ОбщегоНазначенияКлиентСерверУХ.СвернутьСписокЗначений(ПакетДокументов);

	Для Каждого Док Из ПакетДокументовСвертка Цикл
		Если СписокНеМаршрутных.НайтиПоЗначению(Док.Значение) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТаблицаЭтаповПоТекДокументу = ЭтапыСогласованияДляТекущегоСогласующего(Док.Значение, СписокЗадач, ТекущийСогласующий);
		ТаблицаЭтаповПоТекДокументу.Свернуть("ЭтапПроцесса, ПравоРедактирования, ДокументПроцесса, Организация, ДопСогласование, Пользователь");
		ЗначениеВРеквизитФормы(ТаблицаЭтаповПоТекДокументу, "ТекущиеЭтапыСогласования");
		ТекстКомментария = Комментарий.ПолучитьТекст();
		Для Каждого Строка Из ТекущиеЭтапыСогласования Цикл
			СтруктураДобавления = Новый Структура;
			СтруктураДобавления.Вставить("Этап",					 Строка.ЭтапПроцесса);
			СтруктураДобавления.Вставить("ДокументСогласования",	 Строка.ДокументПроцесса);
			СтруктураДобавления.Вставить("Организация",				 Строка.Организация);
			СтруктураДобавления.Вставить("Комментарий",				 ТекстКомментария);
			СтруктураДобавления.Вставить("ТекущийДокумент",			 Строка.ДокументПроцесса.КлючевойОбъектПроцесса);
			СтруктураДобавления.Вставить("ДопСогласование",			 Строка.ДопСогласование);
			СтруктураДобавления.Вставить("Пользователь",			 Строка.Пользователь);
			Если НЕ ПроизвольныйЭтап = Неопределено Тогда
				СтруктураДобавления.Вставить("ПроизвольныйЭтап", ПроизвольныйЭтап);
			КонецЕсли;
			ТекущийЭтап.Добавить(СтруктураДобавления);
		КонецЦикла;	
	КонецЦикла;

	Возврат ТекущийЭтап;

КонецФункции

//ИИТ_Аксеньюшкин
&НаКлиенте
Функция ВыполнитьНепосредственноеОтклонение(ТекущийСогласующий)

	Если СогласовываемыйДокумент <> Неопределено Тогда
		ПакетДокументов = Новый СписокЗначений;
		ПакетДокументов.Добавить(СогласовываемыйДокумент);
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещениюПоТекущемуСогласующему(Неопределено, ТекущийСогласующий);
	Иначе
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещениюПоТекущемуСогласующему(Неопределено, ТекущийСогласующий);
	КонецЕсли;
	// Обход полученных данных.
	СоответствиеДанныхЭтапов = СоответствиеДанныхТекущихЭтапов(ТекущийЭтап);
	РазрешеноЗакрытие = Истина;
	Для Каждого СтрЭтап ИЗ ТекущийЭтап Цикл
		ТекЭтап = СтрЭтап.Этап;
		// Проверим, что заполнен комментарий при отклонении.
		СтруктураДанныхЭтапа = СоответствиеДанныхЭтапов.Получить(ТекЭтап);
		Если СтруктураДанныхЭтапа <> Неопределено Тогда
			ОбязательныйКомментарийПриОтклонении = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДанныхЭтапа, "ОбязательныйКомментарийПриОтклонении", Ложь);
		Иначе
			ОбязательныйКомментарийПриОтклонении = Ложь;
		КонецЕсли;
		НовыйКоментарий = Комментарий.ПолучитьТекст();
		Если (НЕ ОбязательныйКомментарийПриОтклонении) ИЛИ (СокрЛП(НовыйКоментарий) <> "") Тогда
			// Виза доп согласующих.
			Если СтрЭтап.ДопСогласование Тогда
				МодульСогласованияДокументовУХ.ПоставитьДопВизу(СтрЭтап.Пользователь, СтрЭтап.ДокументСогласования, СтрЭтап.Этап, Ложь, СтрЭтап.Комментарий, СтрЭтап.Организация);
			Иначе
				// Т.к. отклонить имеет право любой участник согласования, после установки визы доп согласующего продолжаем выполнение по стандартному алгоритму.
			КонецЕсли;  
			// Непосредственное отклонение.
			Замещение = (СтрЭтап.Пользователь <> ТекПользователь);
			ТекущийЭтап_ = Новый Структура();
			ТекущийЭтап_.Вставить("Этап", СтрЭтап.Этап);
			ТекущийЭтап_.Вставить("ДокументСогласования", СтрЭтап.ДокументСогласования);
			ТекущийЭтап_.Вставить("Организация", СтрЭтап.Организация);
			ТекущийЭтап_.Вставить("Комментарий", Комментарий.ПолучитьТекст());
			МодульУправленияПроцессамиУХ.ОтклонитьЭтап(,ТекущийЭтап_, СтрЭтап.ТекущийДокумент, СтрЭтап.Пользователь, Замещение);
		Иначе
			ТекстСообщения = НСтр("ru = 'Требуется ввести комментарий перед отклонением'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РазрешеноЗакрытие = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РазрешеноЗакрытие;

КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция ЗаявкаСогласованаДосрочно(СогласовываемыйДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсторияВыполненияПроцессов.Пользователь КАК Пользователь,
	|	ПОДСТРОКА(ИсторияВыполненияПроцессов.Комментарий, 1, 100) КАК Комментарий,
	|	ИсторияВыполненияПроцессов.Событие КАК Событие
	|ИЗ
	|	РегистрСведений.ИсторияВыполненияПроцессов КАК ИсторияВыполненияПроцессов
	|ГДЕ
	|	ИсторияВыполненияПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса = &Заявка
	|	И (ИсторияВыполненияПроцессов.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыОповещенийПользователейУХ.ЭтапСогласован)
	|			ИЛИ ИсторияВыполненияПроцессов.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыОповещенийПользователейУХ.ПроцессЗапущен))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсторияВыполненияПроцессов.ПериодСортировкиМс УБЫВ";
	Запрос.УстановитьПараметр("Заявка", СогласовываемыйДокумент);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ПервыйКомментарий = ТЗ[0].Комментарий; 
	Если ПервыйКомментарий = "Оплачено без утверждения управленческом учете" Тогда
		Возврат Истина;	
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция ПолучитьВидМаршрута(СогласовываемыйДокумент)
	Возврат СогласовываемыйДокумент.ИИТ_ВидМаршрута;
КонецФункции

//ИИТ_Аксеньюшкин
Функция ПолучитьМОРСПроекта()
	
	Если ТипЗнч(СогласовываемыйДокумент) <> Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		ВОзврат 0;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(СогласовываемыйДокумент.ИИТ_ОбъектСписания) Тогда  
		Если СогласовываемыйДокумент.ДвиженияОперации.Количество() = 0 ИЛИ (СогласовываемыйДокумент.ДвиженияОперации.Количество() > 0
		И НЕ ЗначениеЗаполнено(СогласовываемыйДокумент.ДвиженияОперации[0].Проект)) Тогда
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
	
	Проект = СогласовываемыйДокумент.ДвиженияОперации[0].Проект;
	Если ЗначениеЗаполнено(СогласовываемыйДокумент.ИИТ_ОбъектСписания) Тогда
		Проект = СогласовываемыйДокумент.ИИТ_ОбъектСписания;
	КонецЕсли;

	Если Проект.ИИТ_МОРС Тогда
		ИИТ_ПроектМОРС = Проект;
	ИначеЕсли Проект.Родитель.ИИТ_МОРС Тогда
		ИИТ_ПроектМОРС = Проект.Родитель;
	ИначеЕсли Проект.Родитель.Родитель.ИИТ_МОРС Тогда
		ИИТ_ПроектМОРС = Проект.Родитель.Родитель;
	ИначеЕсли Проект.Родитель.Родитель.Родитель.ИИТ_МОРС Тогда
		ИИТ_ПроектМОРС = Проект.Родитель.Родитель.Родитель;
	КонецЕсли;
	
	Если ИИТ_ПроектМОРС.ИИТ_НеКонтролироватьОстатокМОРС ИЛИ Строка(СогласовываемыйДокумент.ВидОперацииУХ) = "Перевод внутри счета" Тогда
		Возврат 9999999999999999999999999999999;
	КонецЕсли;
	
	СчетСписания = СогласовываемыйДокумент.ИИТ_СчетОрганизации;
	Если ЗначениеЗаполнено(СогласовываемыйДокумент.ИИТ_ОбъектСписания) Тогда
		СчетСписания = СогласовываемыйДокумент.СчетКассаОрганизации;
	КонецЕсли;
	
	ЖелДата = ?(ЗначениеЗаполнено(СогласовываемыйДокумент.ЖелательнаяДатаПлатежа), СогласовываемыйДокумент.ЖелательнаяДатаПлатежа, ТекущаяДата());

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ИИТ_ДенежныеСредстваОбъектовСтроительстваОстатки.СуммаБДДСОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.ИИТ_ДенежныеСредстваОбъектовСтроительства.Остатки(
	|			&ТекДата,
	|			(ОбъектСтроительства В ИЕРАРХИИ (&ОбъектСтроительства)
	|				ИЛИ ОбъектСтроительства = &ОбъектСтроительства)
	|				И БанковскийСчет = &БанковскийСчет) КАК ИИТ_ДенежныеСредстваОбъектовСтроительстваОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	-ИИТ_РезервыДенежныхСредствОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ИИТ_РезервыДенежныхСредств.Остатки(
	|			&ТекДата,
	|			(ОбъектСтроительства В ИЕРАРХИИ (&ОбъектСтроительства)
	|				ИЛИ ОбъектСтроительства = &ОбъектСтроительства)
	|				И БанковскийСчет = &БанковскийСчет) КАК ИИТ_РезервыДенежныхСредствОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	ВТ КАК ВТ";
	Запрос.УстановитьПараметр("ОбъектСтроительства", ИИТ_ПроектМОРС);
	Запрос.УстановитьПараметр("БанковскийСчет", СчетСписания);
	Запрос.УстановитьПараметр("ТекДата", КонецДня(Мин(ЖелДата, ТекущаяДата())));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сумма = ?(ЗначениеЗаполнено(Выборка.СуммаОстаток), Выборка.СуммаОстаток, 0);
	Иначе
		Сумма = 0;
	КонецЕсли;
	
	//Сообщить("Объект: " + Строка(ИИТ_ПроектМОРС));
	//Сообщить("Счет: " + Строка(СчетСписания));
	//Сообщить("Сумма: " + Строка(Сумма));
	
	Возврат Сумма;
	
КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция ПолучитьПоследнегоСогласовавшего(СогласовываемыйДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсторияВыполненияПроцессов.Пользователь КАК Пользователь,
	|	ПОДСТРОКА(ИсторияВыполненияПроцессов.Комментарий, 1, 100) КАК Комментарий,
	|	ИсторияВыполненияПроцессов.Событие КАК Событие
	|ИЗ
	|	РегистрСведений.ИсторияВыполненияПроцессов КАК ИсторияВыполненияПроцессов
	|ГДЕ
	|	ИсторияВыполненияПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса = &Заявка
	|	И (ИсторияВыполненияПроцессов.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыОповещенийПользователейУХ.ЭтапСогласован)
	|			ИЛИ ИсторияВыполненияПроцессов.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыОповещенийПользователейУХ.ПроцессЗапущен))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсторияВыполненияПроцессов.ПериодСортировкиМс УБЫВ";
	Запрос.УстановитьПараметр("Заявка", СогласовываемыйДокумент);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ПервыйКомментарий = ТЗ[0].Комментарий; 
	Если ПервыйКомментарий = "Оплачено без утверждения управленческом учете" Тогда
		Для Н = 0 По ТЗ.Количество() - 1 Цикл
			Если ТЗ[Н].Комментарий <> "Оплачено без утверждения управленческом учете" Тогда
				Возврат ТЗ[Н-1].Пользователь;
			КонецЕсли;
		КонецЦикла;		
	Иначе
		Для Н = 0 По ТЗ.Количество() - 1 Цикл
			Если ТЗ[Н].Событие = Перечисления.ВидыОповещенийПользователейУХ.ЭтапСогласован Тогда
				Возврат ТЗ[Н].Пользователь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Справочники.Пользователи.ПустаяСсылка();

КонецФункции 

//ИИТ_Аксеньюшкин
Функция ПолучитьСуммуДокументаЗаявки() 
	Возврат СогласовываемыйДокумент.СуммаДокумента;
КонецФункции

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Функция ПолучитьТекущегоСогласующего(СогласовываемыйДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта <> ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Утверждена)
	|			ТОГДА СогласующиеЗаявок.ТекущийСогласующий
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТекущийСогласующий
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних(, Объект ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств) КАК РегистрСостоянийОбъектовСрезПоследних
	|		ПО (РегистрСостоянийОбъектовСрезПоследних.Объект = Документ.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса КАК Заявка,
	|			МАКСИМУМ(ОтложеннаяОбработкаЭтаповПроцессов.Ответственный) КАК ТекущийСогласующий
	|		ИЗ
	|			РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ОтложеннаяОбработкаЭтаповПроцессов
	|		ГДЕ
	|			НЕ ОтложеннаяОбработкаЭтаповПроцессов.Выполнено
	|			И ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|			И ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса = &ТекЗаявка
	|			И НЕ ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.ПометкаУдаления
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОтложеннаяОбработкаЭтаповПроцессов.ДокументПроцесса.КлючевойОбъектПроцесса) КАК СогласующиеЗаявок
	|		ПО Документ.Ссылка = СогласующиеЗаявок.Заявка
	|ГДЕ
	|	Документ.Ссылка = &ТекЗаявка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта <> ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Утверждена)
	|			ТОГДА СогласующиеЗаявок.ТекущийСогласующий
	|		ИНАЧЕ """"
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("ТекЗаявка", СогласовываемыйДокумент);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекущийСогласующий = Выборка.ТекущийСогласующий;
	Иначе
		ТекущийСогласующий = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;	
	
	Возврат ТекущийСогласующий;
	
КонецФункции

//ИИТ_Аксеньюшкин
Функция ТекПользовательЗаместитель(ТекПользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заместители.ЗамещаемыйПользователь КАК ЗамещаемыйПользователь
	|ИЗ
	|	РегистрСведений.Заместители КАК Заместители
	|ГДЕ
	|	Заместители.ЗамещаемыйПользователь = &ПользовательДляСогласования
	|	И Заместители.Заместитель = &ТекПользователь";
	Запрос.УстановитьПараметр("ПользовательДляСогласования", Константы.ИИТ_ПользовательДляСогласованияВнутреннихПереводов.Получить());
	Запрос.УстановитьПараметр("ТекПользователь", ТекПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//ИИТ_Аксеньюшкин
Функция ТекущийСогласующийЯвляетсяАдмнистратором()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГруппыДоступаПользователи.Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|ГДЕ
	|	ГруппыДоступаПользователи.Пользователь = &ТекПользователь
	|	И ГруппыДоступаПользователи.Ссылка.Наименование = ""Администраторы""";
	Запрос.УстановитьПараметр("ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

//ИИТ_Аксеньюшкин
Функция ТекущийСогласующийЯвляетсяМОРСом()
	
	ВидМаршрута = ПолучитьВидМаршрута(СогласовываемыйДокумент);
	
	Если Строка(ВидМаршрута) = "По списку согласующих казначейство" Тогда
		
		Если ЗначениеЗаполнено(Наименование) Тогда
			Если Найти(Наименование, "8") > 0 Тогда
				Возврат Истина;
			КонецЕсли;
		Иначе
			Если Найти(Строка(ТекущиеЭтапыСогласования[0].ЭтапПроцесса), "Этап согласования 8") > 0 Тогда
				Возврат Истина;
			КонецЕсли;			
		КонецЕсли;

	ИначеЕсли Строка(ВидМаршрута) = "Один пользователь" Тогда

		Возврат Истина;

	ИначеЕсли Строка(ВидМаршрута) = "Финансовый вид деятельности" Тогда

		Если ТекПользователь = Константы.ИИТ_ПользовательДляСогласованияВнутреннихПереводов.Получить() ИЛИ ТекПользовательЗаместитель(ТекПользователь) Тогда
			Возврат Истина;
		КонецЕсли;

	ИначеЕсли Строка(ВидМаршрута) = "Внутренний с бухгалтером" Тогда

		Если ТекПользователь = Константы.ИИТ_ПользовательДляСогласованияВнутреннихПереводов.Получить() ИЛИ ТекПользовательЗаместитель(ТекПользователь) Тогда
			Возврат Истина;
		КонецЕсли;
		
	ИначеЕсли Строка(ВидМаршрута) = "Рыжкова, Кабанов, Кузнецов, Бухглатер" Тогда

		Если ТекПользователь = Константы.ИИТ_ПользовательДляСогласованияВнутреннихПереводов.Получить() ИЛИ ТекПользовательЗаместитель(ТекПользователь) Тогда
			Возврат Истина;
		КонецЕсли;

	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

//ИИТ_Аксеньюшкин
Функция ЭтапыСогласованияДляТекущегоСогласующего(ОбъектСогласования, СписокЗадачВход, ТекущийСогласующий)

	РезультатФункции = МодульУправленияПроцессамиУХ.ЭтапыСогласованияДляПользователя(ОбъектСогласования, ТекущийСогласующий, , СписокЗадачВход);
	//+ИИТ_Аксеньюшкин
	Если РезультатФункции.Количество() = 0 Тогда
		РезультатФункции = МодульУправленияПроцессамиУХ.ЭтапыСогласованияДляПользователя(ОбъектСогласования, Справочники.Пользователи.ОтветственныйЗаБанковскийСчет, , СписокЗадачВход);
	КонецЕсли;
	Если РезультатФункции.Количество() = 0 Тогда
		РезультатФункции = МодульУправленияПроцессамиУХ.ЭтапыСогласованияДляПользователя(ОбъектСогласования, Справочники.Пользователи.НайтиПоНаименованию("Бухгалтер", Истина), , СписокЗадачВход);
	КонецЕсли;
	//-ИИТ_Аксеньюшкин
	Возврат РезультатФункции;	
	
КонецФункции

//ИИТ_Аксеньюшкин
Процедура ОтменитьПроведениеДокументаПоМОРС()
	
	Если ТипЗнч(СогласовываемыйДокумент) <> Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		Возврат;
	КонецЕсли;

	ДокОбъект = СогласовываемыйДокумент.ПолучитьОбъект();
	ДокОбъект.ИИТ_МОРС_Пройден = Ложь;
	ДокОбъект.ОбменДанными.Загрузка = Истина;
	ДокОбъект.Записать();
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ПроверитьДокументПоДатеПровести()

	Если СогласовываемыйДокумент.ЖелательнаяДатаПлатежа < НачалоДня(ТекущаяДата()) И Не СогласовываемыйДокумент.ИИТ_МОРСЗаднимЧислом Тогда
		ДокОбъект = СогласовываемыйДокумент.ПолучитьОбъект();
		ДокОбъект.ЖелательнаяДатаПлатежа = ТекущаяДата();
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
&НаСервереБезКонтекста
Процедура ПроверитьСнятьПометкуМОРСПройден(ТекущийСогласующий, СогласовываемыйДокумент)
	
	ВидМаршрута = СогласовываемыйДокумент.ИИТ_ВидМаршрута;
	СнятьОтметку = Ложь;
	
	Если Строка(ВидМаршрута) = "По списку согласующих казначейство" Тогда
		
		ИндексТекущегоСогласующего = 0;
		Для Н = 1 По 16 Цикл
			Если СогласовываемыйДокумент.ИИТ_ПроектСогласования["ИИТ_Согласующий" + Строка(Н)] = ТекущийСогласующий Тогда
				ИндексТекущегоСогласующего = Н;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ИндексТекущегоСогласующего <> 0 И ИндексТекущегоСогласующего <= 8 Тогда
			СнятьОтметку = Истина;
		КонецЕсли;

	ИначеЕсли Строка(ВидМаршрута) = "Один пользователь" Тогда

		СнятьОтметку = Истина;

	ИначеЕсли Строка(ВидМаршрута) = "Финансовый вид деятельности" Тогда

		Если ТекущийСогласующий = Константы.ИИТ_ПользовательДляСогласованияВнутреннихПереводов.Получить() Тогда
			СнятьОтметку = Истина;
		КонецЕсли;

	ИначеЕсли Строка(ВидМаршрута) = "Внутренний с бухгалтером" Тогда

		Если ТекущийСогласующий = Константы.ИИТ_ПользовательДляСогласованияВнутреннихПереводов.Получить() Тогда
			СнятьОтметку = Истина;
		КонецЕсли;
		
	ИначеЕсли Строка(ВидМаршрута) = "Рыжкова, Кабанов, Кузнецов, Бухглатер" Тогда

		Если ТекущийСогласующий = Константы.ИИТ_ПользовательДляСогласованияВнутреннихПереводов.Получить() Тогда
			СнятьОтметку = Истина;
		КонецЕсли;

	КонецЕсли;
	
	Если СнятьОтметку Тогда
		ДокОбъект = СогласовываемыйДокумент.ПолучитьОбъект();
		ДокОбъект.ИИТ_МОРС_Пройден = Ложь;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;

КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура ПровестиДокументПоМОРС()
	ДокОбъект = СогласовываемыйДокумент.ПолучитьОбъект();
	ДокОбъект.ИИТ_МОРС_Пройден = Истина;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьЕдиничныйОтчетОтчет(Команда)
		
	// Получения данных для обработки.
	Если СогласовываемыйДокумент <> Неопределено Тогда
		ПакетДокументов = Новый СписокЗначений;
		ПакетДокументов.Добавить(СогласовываемыйДокумент);
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	Иначе
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	КонецЕсли;
	// Обход полученных данных.
	СоответствиеДанныхЭтапов = СоответствиеДанныхТекущихЭтапов(ТекущийЭтап);
	РазрешеноЗакрытие = Истина;
	Для Каждого СтрЭтап ИЗ ТекущийЭтап Цикл
		Замещение = (СтрЭтап.Пользователь <> ТекПользователь);
		ТекЭтап = СтрЭтап.Этап;
		// Проверим, что заполнен комментарий при утверждении.
		СтруктураДанныхЭтапа = СоответствиеДанныхЭтапов.Получить(ТекЭтап);
		Если СтруктураДанныхЭтапа <> Неопределено Тогда
			ОбязательныйКомментарийПриСогласовании = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДанныхЭтапа, "ОбязательныйКомментарийПриСогласовании", Ложь);
		Иначе
			ОбязательныйКомментарийПриСогласовании = Ложь;
		КонецЕсли;
		НовыйКоментарий = Комментарий.ПолучитьТекст();
		Если (НЕ ОбязательныйКомментарийПриСогласовании) ИЛИ (СокрЛП(НовыйКоментарий) <> "") Тогда
			Если СтрЭтап.ДопСогласование Тогда
				// Виза доп согласующих.
				МодульСогласованияДокументовУХ.УтвердитьЭтапДополнительногоСогласования(СтрЭтап.Пользователь, СтрЭтап.ДокументСогласования, ТекЭтап, СтрЭтап.Комментарий, СтрЭтап.Организация, Замещение);	
			Иначе
				// Непосредственное утверждение.
				ТекущийЭтап_ = Новый Структура();
				ТекущийЭтап_.Вставить("Этап", ТекЭтап);
				ТекущийЭтап_.Вставить("ДокументСогласования", СтрЭтап.ДокументСогласования);
				ТекущийЭтап_.Вставить("Организация", СтрЭтап.Организация);
				ТекущийЭтап_.Вставить("Комментарий", НовыйКоментарий);
				Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") Тогда
					ИдентификаторФормыДляПротокола = ВладелецФормы.УникальныйИдентификатор;
				Иначе
					ИдентификаторФормыДляПротокола = Неопределено;
				КонецЕсли;
				МодульУправленияПроцессамиУХ.УтвердитьЭтап(, ТекущийЭтап_, СтрЭтап.ТекущийДокумент, СтрЭтап.Пользователь, Замещение, ИдентификаторФормыДляПротокола);	
			КонецЕсли; 	
		Иначе
			ТекстСообщения = НСтр("ru = 'Требуется ввести комментарий перед утверждением'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РазрешеноЗакрытие = Ложь;
		КонецЕсли;
	КонецЦикла;
	Попытка
	ИИТ_ВспомогательныеФункцииСервер.ОбновитьСтатусИСогласующего(СтрЭтап.ТекущийДокумент); //СмирновРВ    
Исключение
	КонецПопытки;
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура УведомитьОбОтменеАО()
	
	Если ТипЗнч(СогласовываемыйДокумент) <> Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		Возврат;
	КонецЕсли;
	
	НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
	НоваяЗапись.ДатаСоздания = ТекущаяДата();
	НоваяЗапись.Заявка = СогласовываемыйДокумент;
	НоваяЗапись.Ответственный = СогласовываемыйДокумент.ИИТ_Инициатор;
	НоваяЗапись.Пояснение = "Отменено согласование авансового отчета";
	НоваяЗапись.Записать(Истина);
	
	ДокПроцесса = Документы.ЭкземплярПроцесса.ПустаяСсылка();
	
	Для Н = 1 По 8 Цикл
		
		СогласующийПоПлану = СогласовываемыйДокумент.ИИТ_ОбъектСтроительства["ИИТ_ПрочееСогласующий" + Строка(Н)];
		Если СогласующийПоПлану = ПараметрыСеанса.ТекущийПользователь Тогда
			Прервать;
		КонецЕсли;
	
		НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
		НоваяЗапись.ДатаСоздания = ТекущаяДата();
		НоваяЗапись.Заявка = СогласовываемыйДокумент;
		НоваяЗапись.Ответственный = СогласующийПоПлану;
		НоваяЗапись.Пояснение = "Отменено согласование авансового отчета";
		НоваяЗапись.Записать(Истина);

	КонецЦикла;
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура УведомитьОбОтменеЗаявкиНаРасходДС()

	Если ТипЗнч(СогласовываемыйДокумент) <> Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		Возврат;
	КонецЕсли;

	НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
	НоваяЗапись.ДатаСоздания = ТекущаяДата();
	НоваяЗапись.Заявка = СогласовываемыйДокумент;
	НоваяЗапись.Ответственный = СогласовываемыйДокумент.Инициатор;
	НоваяЗапись.Пояснение = "Отменено согласование заявки на расходование ДС";
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры

//ИИТ_Аксеньюшкин
Процедура УведомитьОбОтменеЗЗ()
	
	Если ТипЗнч(СогласовываемыйДокумент) <> Тип("ДокументСсылка.ИИТ_ЗаявкаНаЗакуп") Тогда
		Возврат;
	КонецЕсли;
	
	НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
	НоваяЗапись.ДатаСоздания = ТекущаяДата();
	НоваяЗапись.Заявка = СогласовываемыйДокумент;
	НоваяЗапись.Ответственный = СогласовываемыйДокумент.Инициатор;
	НоваяЗапись.Пояснение = "Отменено согласование заявки на закуп";
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	//+ИИТ_Аксеньюшкин
	Если РольДоступна("ИИТ_ЗапретВозвратаЗаявки") Тогда
		Элементы.ОтклонитьОтчет.Доступность = Ложь;
		Элементы.ВернутьИсполнителю.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.ОтклонитьОтчет.Видимость = Ложь;
	//-ИИТ_Аксеньюшкин

КонецПроцедуры

&НаКлиенте
Процедура АЛФ_ВернутьИсполнителюПеред(Команда)

		Если Не ЗначениеЗаполнено(Комментарий.ПолучитьТекст()) Тогда
		Сообщить("Для отклонения необходимо заполнить комментарий");
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АЛФ_ВернутьИсполнителюПосле(Команда)

	ОтменитьПроведениеДокументаПоМОРС();
	УведомитьОбОтменеАО();
	УведомитьОбОтменеЗЗ();
	//УведомитьОбОтменеЗаявкиНаРасходДС();
	
	Оповестить("ИИТ_ЗакрытьФормуПриСогласовании", Новый Структура("Заявка", СогласовываемыйДокумент));

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПередЗакрытием")
Процедура АЛФ_ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = Ложь;
	Если ЭтаФорма.Модифицированность Тогда
#Удаление	
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Виза сохранена не будет. Закрыть согласование?'");
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеЗакрытияЗавершение", ЭтаФорма);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
#КонецУдаления		
	Иначе
		Если НЕ ЗавершениеРаботы Тогда
			Оповестить("ОбновитьМоиЗадачиИОповещения");		
		Иначе
			// Не требуется изменять содержимое формы Мои оповещения. Отключено с целью избежать серверных вызовов.
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
&ИзменениеИКонтроль("СогласоватьОтчет")
Процедура АЛФ_СогласоватьОтчет(Команда)
#Удаление	
	// Получения данных для обработки.
	Если СогласовываемыйДокумент <> Неопределено Тогда
		ПакетДокументов = Новый СписокЗначений;
		ПакетДокументов.Добавить(СогласовываемыйДокумент);
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	Иначе
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	КонецЕсли;
	// Обход полученных данных.
	СоответствиеДанныхЭтапов = СоответствиеДанныхТекущихЭтапов(ТекущийЭтап);
	РазрешеноЗакрытие = Истина;

	ЕстьТекущийПользователь = Ложь;
	Для Каждого СтрЭтап ИЗ ТекущийЭтап Цикл
		Если СтрЭтап.Пользователь = ТекПользователь Тогда
			ЕстьТекущийПользователь = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Для Каждого СтрЭтап ИЗ ТекущийЭтап Цикл
		Замещение = (СтрЭтап.Пользователь <> ТекПользователь);

		Если Замещение И ЕстьТекущийПользователь Тогда
			Продолжить;
		КонецЕсли;

		ТекЭтап = СтрЭтап.Этап;
		// Проверим, что заполнен комментарий при утверждении.
		СтруктураДанныхЭтапа = СоответствиеДанныхЭтапов.Получить(ТекЭтап);
		Если СтруктураДанныхЭтапа <> Неопределено Тогда
			ОбязательныйКомментарийПриСогласовании = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДанныхЭтапа, "ОбязательныйКомментарийПриСогласовании", Ложь);
		Иначе
			ОбязательныйКомментарийПриСогласовании = Ложь;
		КонецЕсли;
		НовыйКоментарий = Комментарий.ПолучитьТекст();
		Если (НЕ ОбязательныйКомментарийПриСогласовании) ИЛИ (СокрЛП(НовыйКоментарий) <> "") Тогда

			ИдентификаторФормы = ИдентификаторФормыВладельца(ВладелецФормы);

			Если СтрЭтап.ДопСогласование Тогда
				// Виза доп согласующих.
				МодульСогласованияДокументовУХ.УтвердитьЭтапДополнительногоСогласования(
				СтрЭтап.Пользователь, СтрЭтап.ДокументСогласования, ТекЭтап, СтрЭтап.Комментарий,
				СтрЭтап.Организация, Замещение, ИдентификаторФормы);
			Иначе
				// Непосредственное утверждение.
				ТекущийЭтап_ = Новый Структура();
				ТекущийЭтап_.Вставить("Этап", ТекЭтап);
				ТекущийЭтап_.Вставить("ДокументСогласования", СтрЭтап.ДокументСогласования);
				ТекущийЭтап_.Вставить("Организация", СтрЭтап.Организация);
				ТекущийЭтап_.Вставить("Комментарий", НовыйКоментарий);

				МодульУправленияПроцессамиУХ.УтвердитьЭтап(, ТекущийЭтап_, СтрЭтап.ТекущийДокумент,
				СтрЭтап.Пользователь, Замещение, ИдентификаторФормы);

			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'Требуется ввести комментарий перед утверждением'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РазрешеноЗакрытие = Ложь;
		КонецЕсли;
	КонецЦикла;
	// Обновление интерфейса.
	Оповестить("ОбновитьМоиЗадачиИОповещения");
	Оповестить("СостояниеЗаявкиПриИзменении");
	Если РазрешеноЗакрытие Тогда
		Модифицированность = Ложь;
		Закрыть(Новый Структура("Режим","КнопкаСогласовать"));
	Иначе
		// Не закрываем форму.
	КонецЕсли;
#КонецУдаления
#Вставка
	//+ИИТ_Аксеньюшкин
	Если СогласовываемыйДокумент = Неопределено Тогда

		ДокументыКСогласованию = ПакетДокументов.ВыгрузитьЗначения();
		//Для Каждого ДокументСогласования Из ДокументыКСогласованию Цикл

		//	СогласовываемыйДокумент = ДокументСогласования;
		//	
		//	Если Лев(Строка(ТипЗнч(СогласовываемыйДокумент)), 6) = "Заявка" Тогда
		//		ТекущийСогласующийЯвляетсяМОРСом = ТекущийСогласующийЯвляетсяМОРСом();
		//		Если ТекущийСогласующийЯвляетсяМОРСом Тогда
		//			ПроверитьДокументПоДатеПровести();
		//			Оповестить("ПеречитатьФорму", СогласовываемыйДокумент);
		//			СуммаМОРС = ПолучитьМОРСПроекта();
		//			СуммаДокумента = ПолучитьСуммуДокументаЗаявки();
		//			Если СуммаМОРС - СуммаДокумента < 0 Тогда
		//				Сообщить("Ошибка согласования документа: " + Строка(СогласовываемыйДокумент) + ". Недостаточно денежных средств в бюджете проекта. Нехватка: "
		//						 + Формат(СуммаДокумента - СуммаМОРС, "ЧЦ=15; ЧДЦ=2"));
		//				Продолжить;
		//			КонецЕсли;
		//			ПровестиДокументПоМОРС();
		//		КонецЕсли;
		//	КонецЕсли;

		//	СогласоватьЕдиничныйОтчетОтчет(Команда);

		//КонецЦикла;
		
		Для Каждого СтрокаТЗСогласования Из ТаблицаПакетаДокументов Цикл

			СогласовываемыйДокумент = СтрокаТЗСогласования.ОбъектСогласования;
			Наименование = СтрокаТЗСогласования.Этап;
			
			Если Лев(Строка(ТипЗнч(СогласовываемыйДокумент)), 6) = "Заявка"
			И Строка(ТипЗнч(СогласовываемыйДокумент)) <> "Заявка на закуп" Тогда
				ТекущийСогласующийЯвляетсяМОРСом = ТекущийСогласующийЯвляетсяМОРСом();
				Если ТекущийСогласующийЯвляетсяМОРСом Тогда
					ПроверитьДокументПоДатеПровести();
					Оповестить("ПеречитатьФорму", СогласовываемыйДокумент);
					СуммаМОРС = ПолучитьМОРСПроекта();
					СуммаДокумента = ПолучитьСуммуДокументаЗаявки();
					Если СуммаМОРС - СуммаДокумента < 0 Тогда
						Сообщить("Ошибка согласования документа: " + Строка(СогласовываемыйДокумент) + ". Недостаточно денежных средств в бюджете проекта. Нехватка: "
								 + Формат(СуммаДокумента - СуммаМОРС, "ЧЦ=15; ЧДЦ=2"));
						Продолжить;
					КонецЕсли;
					ПровестиДокументПоМОРС();
				КонецЕсли;
			КонецЕсли;

			СогласоватьЕдиничныйОтчетОтчет(Команда);

		КонецЦикла;

	Иначе
		
		Если Лев(Строка(ТипЗнч(СогласовываемыйДокумент)), 6) = "Заявка"
		И Строка(ТипЗнч(СогласовываемыйДокумент)) <> "Заявка на закуп" Тогда
			ТекущийСогласующийЯвляетсяМОРСом = ТекущийСогласующийЯвляетсяМОРСом();
			Если ТекущийСогласующийЯвляетсяМОРСом Тогда
				ПроверитьДокументПоДатеПровести();
				Оповестить("ПеречитатьФорму", СогласовываемыйДокумент);
				СуммаМОРС = ПолучитьМОРСПроекта();
				СуммаДокумента = ПолучитьСуммуДокументаЗаявки();
				Если СуммаМОРС - СуммаДокумента < 0 Тогда
					Сообщить("Ошибка согласования документа: " + Строка(СогласовываемыйДокумент) + ". Недостаточно денежных средств в бюджете проекта. Нехватка: "
							 + Формат(СуммаДокумента - СуммаМОРС, "ЧЦ=15; ЧДЦ=2"));
					Возврат;
				КонецЕсли;
				ПровестиДокументПоМОРС();
			КонецЕсли;
		КонецЕсли;

		СогласоватьЕдиничныйОтчетОтчет(Команда);

	КонецЕсли;
	
	// Обновление интерфейса.
	Оповестить("ОбновитьМоиЗадачиИОповещения");
	Оповестить("СостояниеЗаявкиПриИзменении");
	Оповестить("ИИТ_ЗакрытьФормуПриСогласовании", Новый Структура("Заявка", СогласовываемыйДокумент));
	Модифицированность = Ложь;
	Попытка
		Закрыть(Новый Структура("Режим","КнопкаСогласовать"));
	Исключение
	КонецПопытки;
#КонецВставки
КонецПроцедуры


&НаКлиенте   
&ИзменениеИКонтроль("ОтклонитьОтчет")
Процедура АЛФ_ОтклонитьОтчет(Команда)
	#Вставка
	Если Не ЗначениеЗаполнено(Комментарий.ПолучитьТекст()) Тогда
		Сообщить("Для отклонения необходимо заполнить комментарий");
		Возврат;
	КонецЕсли;
#КонецВставки  
#Удаление
	// Получения данных для обработки.
	Если СогласовываемыйДокумент <> Неопределено Тогда
		ПакетДокументов = Новый СписокЗначений;
		ПакетДокументов.Добавить(СогласовываемыйДокумент);
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	Иначе
		ТекущийЭтап = ВернутьМассивДляПередачиПоОповещению();
	КонецЕсли;
	// Обход полученных данных.
	СоответствиеДанныхЭтапов = СоответствиеДанныхТекущихЭтапов(ТекущийЭтап);
	РазрешеноЗакрытие = Истина;
	Для Каждого СтрЭтап ИЗ ТекущийЭтап Цикл
		ТекЭтап = СтрЭтап.Этап;
		// Проверим, что заполнен комментарий при отклонении.
		СтруктураДанныхЭтапа = СоответствиеДанныхЭтапов.Получить(ТекЭтап);
		Если СтруктураДанныхЭтапа <> Неопределено Тогда
			ОбязательныйКомментарийПриОтклонении = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДанныхЭтапа, "ОбязательныйКомментарийПриОтклонении", Ложь);
		Иначе
			ОбязательныйКомментарийПриОтклонении = Ложь;
		КонецЕсли;
		НовыйКоментарий = Комментарий.ПолучитьТекст();
		Если (НЕ ОбязательныйКомментарийПриОтклонении) ИЛИ (СокрЛП(НовыйКоментарий) <> "") Тогда
			
			ИдентификаторФормы = ИдентификаторФормыВладельца(ВладелецФормы);
			
			// Виза доп согласующих.
			Если СтрЭтап.ДопСогласование Тогда
				МодульСогласованияДокументовУХ.ПоставитьДопВизу(СтрЭтап.Пользователь, СтрЭтап.ДокументСогласования,
					СтрЭтап.Этап, Ложь, СтрЭтап.Комментарий, СтрЭтап.Организация,, ИдентификаторФормы);
			Иначе
				// Т.к. отклонить имеет право любой участник согласования, после установки визы доп согласующего продолжаем выполнение по стандартному алгоритму.
			КонецЕсли;  
			// Непосредственное отклонение.
			Замещение = (СтрЭтап.Пользователь <> ТекПользователь);
			ТекущийЭтап_ = Новый Структура();
			ТекущийЭтап_.Вставить("Этап", СтрЭтап.Этап);
			ТекущийЭтап_.Вставить("ДокументСогласования", СтрЭтап.ДокументСогласования);
			ТекущийЭтап_.Вставить("Организация", СтрЭтап.Организация);
			ТекущийЭтап_.Вставить("Комментарий", Комментарий.ПолучитьТекст());
			
			МодульУправленияПроцессамиУХ.ОтклонитьЭтап(,ТекущийЭтап_, СтрЭтап.ТекущийДокумент,
				СтрЭтап.Пользователь, Замещение,, ИдентификаторФормы, Истина);
			
		Иначе
			ТекстСообщения = НСтр("ru = 'Требуется ввести комментарий перед отклонением'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РазрешеноЗакрытие = Ложь;
		КонецЕсли;
	КонецЦикла;
#КонецУдаления
#Вставка
	ТекущийСогласующий = ПолучитьТекущегоСогласующего(СогласовываемыйДокумент);
	Если ТипЗнч(СогласовываемыйДокумент) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда		

		ЗаявкаСогласованаДосрочно = ЗаявкаСогласованаДосрочно(СогласовываемыйДокумент);
		Если ЗаявкаСогласованаДосрочно Тогда
			ПоследнийСогласовавший = ПолучитьПоследнегоСогласовавшего(СогласовываемыйДокумент);
			Пока ТекущийСогласующий <> ПоследнийСогласовавший Цикл
				СписокЗадач = Новый СписокЗначений;
				РазрешеноЗакрытие = ВыполнитьНепосредственноеОтклонение(ТекущийСогласующий);
				ТекущийСогласующий = ПолучитьТекущегоСогласующего(СогласовываемыйДокумент);
			КонецЦикла;
		Иначе
			РазрешеноЗакрытие = ВыполнитьНепосредственноеОтклонение(ТекущийСогласующий);
		КонецЕсли;
	Иначе
		РазрешеноЗакрытие = ВыполнитьНепосредственноеОтклонение(ТекущийСогласующий);
	КонецЕсли;
	ТекущийСогласующий = ПолучитьТекущегоСогласующего(СогласовываемыйДокумент);
	ПроверитьСнятьПометкуМОРСПройден(ТекущийСогласующий, СогласовываемыйДокумент);
#КонецВставки	
	// Обновление интерфейса.
	Оповестить("ОбновитьМоиЗадачиИОповещения");		
	Оповестить("СостояниеЗаявкиПриИзменении");
	Если РазрешеноЗакрытие Тогда
		ЭтаФорма.Модифицированность = Ложь;
		Закрыть(Новый Структура("Режим","КнопкаОтклонить"));
	Иначе
		// Не закрываем форму.
	КонецЕсли;
КонецПроцедуры
